#ifndef PC_COMMUNICATION_H
#define PC_COMMUNICATION_H

//константы
//===========================================================================
//номера команд от ПК
#define COMMAND_CONNECTION              0x19
#define COMMAND_READ_ALL_SETTINGS       0x28
#define COMMAND_WRITE_WORK_SETTINGS     0x37
#define COMMAND_WRITE_UART_SETTINGS     0x46
#define COMMAND_WRITE_SERIAL_NUMBER     0x55
#define COMMAND_RESET_MCU               0x91
//===========================================================================

#define PC_BUF_SIZE     100
//===========================================================================
//переменные
//===========================================================================

//uint8_t buf[PC_BUF_SIZE];       /*буфер для передачи сообщений компьютеру*/
//uint8_t lenth=0;        /*длина посылки в буфере*/
//uint8_t mess_flag=0;    /*флаг индикатор наличия посылки*/
//===========================================================================


//функции
//===========================================================================
uint8_t CheckRxBufWithMW(uint8_t* buf); /*проверяет буфер с кодовым словом. Возвращает 1 если совпало, если нет то 0*/
uint8_t AnswerStartCommunication_19(uint8_t* buf);//формирует ответ после запроса на начало коммуникации, возвращает длину буфера (вместе с црц)
uint8_t CheckPCmessage(uint8_t* buf, uint8_t len);   //проверяет буфер на наличие посылки от комьютера и готовит ответ. Возвращает 0 если поыслка не наша, если надо ответить возвращает длину буфера
uint8_t ReadAndSendAllSettings(uint8_t* buf); //Читает и записывает в буфер все настройки, возвращает размер буфера(вместе с рцр)
uint8_t AnswerRsetMCU(void);// отвечает на команду ресета и выставляет флаг ресета
uint8_t AnswerWriteWorkSetting(uint8_t* buf);   //формирует ответ и записывает пришедшие настройки в еепром
uint8_t AnswerWriteUartSetting(uint8_t* buf);   //формирует ответ и записывает пришедшие настройки в еепром
uint8_t AnswerWriteSerialNumber(uint8_t* buf);   //формирует ответ и записывает серийный номер в еепром
//===========================================================================


#endif  //PC_COMMUNICATION_H